<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE>Wichtige Begriffe f&uuml;r C++ in Jumli</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.0.1  (Win32)">
	<META NAME="AUTHOR" CONTENT="Martin Winkler">
	<META NAME="CREATED" CONTENT="20030919;9553522">
	<META NAME="CHANGED" CONTENT="16010101;0">
	<META NAME="KEYWORDS" CONTENT="Glossar,C++,Jumli">
	<STYLE>
	<!--
		TD P { color: #000000 }
		H1 { color: #000000 }
		P { color: #000000 }
		H3 { color: #000000 }
		PRE { color: #000000 }
		A:visited { color: #ff0000 }
		A:link { color: #ff0000 }
	-->
	</STYLE>
</HEAD>
<BODY LANG="de-DE" TEXT="#000000" LINK="#ff0000" VLINK="#ff0000" BGCOLOR="#ffffff">
<CENTER>
	<TABLE WIDTH=810 BORDER=0 CELLPADDING=2 CELLSPACING=2 STYLE="page-break-before: always">
		<TR>
			<TD></TD>
			<TD STYLE="background: url(../../img/KopfImg/CKopf.jpg) repeat scroll">
				<H1 ALIGN=CENTER>Wichtige Begriffe f&uuml;r Jumli und C++</H1>
			</TD>
		</TR>
	</TABLE>
</CENTER>
<H3><A NAME="Compiler"></A>Compiler</H3>
<P>C++ ist eine sogenannte Hochsprache. Sie wurde entwickelt, um dem
Menschen das Programmieren zu vereinfachen. Sie arbeitet auf viel
h&ouml;herem Abstraktionsniveau als die Maschinensprache, die Ihr PC
ausf&uuml;hren kann. Der Compiler ist nun ein Programm, das Ihr
C++-Programm &quot;versteht&quot; und daraus die richtigen
Maschinenbefehle f&uuml;r Ihren Rechner erzeugen kann, damit der
nachher auch das tut, was im C++-Programm beschrieben ist.</P>
<P>Ein C++-Programm mu&szlig; nach dem Compilieren auch noch gelinkt
werden. Was das bedeutet, lesen Sie <A HREF="#linken">hier.</A></P>
<P>&Uuml;brigens: Wenn es nicht so l&auml;uft, wie es soll, dann
liegt es meistens an Ihrem Programm und nicht am Compiler. Oder, wie
die Informatiker sagen: <I>&quot;Meistens sitzt das Problem davor.&quot;</I>
</P>
<H3><A NAME="Debugger"></A>Debugger</H3>
<P>Auch dem besten Programmierer passieren Fehler bei der Arbeit. Das
ist ganz normal. Ein Programm, das auf Anhieb fehlerfrei l&auml;uft,
das gibt es nicht - solange es in der Funktionalit&auml;t &uuml;ber
das einfache &quot;Hallo Welt!&quot; hinausgeht. Programmfehler sind
nicht schlimm. Schlimm ist es, wenn man sie nicht findet. Doch daf&uuml;r
gibt es Unterst&uuml;tzung:</P>
<P>Der Debugger ist ein Programm, das dem Programmierer hilft, Fehler
in seinem Programm zu finden. Mit Hilfe des Debuggers k&ouml;nnen Sie
zum Beispiel Schritt f&uuml;r Schritt verfolgen, was beim
Programmlauf passiert. Sie k&ouml;nnen sozusagen zusehen, was der
Computer tut. Und Sie k&ouml;nnen sich jederzeit die Inhalte der
Programmvariablen ansehen und bei Bedarf auch ver&auml;ndern. Und Sie
k&ouml;nnen soganannte Breakpoints setzen, um das Programm an einer
bestimmten Stelle anzuhalten, die Sie sich genauer ansehen m&ouml;chten.</P>
<H3><A NAME="linken"></A>linken</H3>
<P>&quot;linken&quot;, das hat nichts mit links oder rechts zu tun,
und reingelegt wird dabei auch niemand.</P>
<P>Der compilierte Code Ihres C++-Programms braucht in der Regel noch
Funktionalit&auml;t aus anderen Bibliotheken. Das kann (zumindest)
die Laufzeitbibliothek des Compilers sein oder sogenannte
Importbibliotheken, die den Zugriff auf Funktionen in DLLs (so k&ouml;nnen
Sie zum Beispiel fast alle Funktionen von Ihres Betriebssystems
nutzen) erm&ouml;glichen. Oder sogenannte statische Bibliotheken, die
fertig compilierten Code enthalten und diesen f&uuml;r andere
Programme bereitstellen. Statische Bibliotheken haben genau wie die
Importbibliotheken &uuml;blicherweise die Endung &quot;.lib&quot; 
</P>
<P>Die f&uuml;r ein Programm ben&ouml;tigten Funktionen mu&szlig;
also aus vielen Quellen zusammengef&uuml;gt werden. Diesen Vorgang
nennt man &quot;linken&quot;, und das Programm, welches dies
erledigt, ist der &quot;Linker&quot;.</P>
<P>Oft sind <A HREF="#Compiler">Compiler</A> und Linker im selben
Programm vereint, und &uuml;ber Kommandozeilenparameter kann
gesteuert werden, ob compiliert, gelinkt oder beides gemacht werden
soll.</P>
<H3><A NAME="main"></A>int main()</H3>
<P>Jedes C++-Programm braucht einen Einstiegspunkt, damit der
<A HREF="#Compiler">Compiler</A> wei&szlig;, an welcher Stelle es
losgeht. Dies ist in C++ die Funktion <B>int main()</B>, die wie
folgt deklariert ist:</P>
<PRE STYLE="margin-bottom: 0.5cm">int main();</PRE><P>
oder 
</P>
<PRE STYLE="margin-bottom: 0.5cm">int main( int argc, char ** argv );</PRE>
<TABLE CELLPADDING=2 CELLSPACING=2 BGCOLOR="#dfdfdf">
	<TR>
		<TD>
			<P>Im Unterschied zu Java ist die main()-Funktion in C++ eine
			freistehende Funktion und nicht Methode einer &quot;Haupt&quot;-Klasse.<BR>Das
			liegt zum einen daran, da&szlig; C++ in dieser Hinsicht kompatibel
			zu C sein will, und zum anderen daran, da&szlig; C++ mehrere
			Programmierparadigmen unterst&uuml;tzt, w&auml;hrend Java nur die
			objektorientierte Programmierung unterst&uuml;tzt. 
			</P>
		</TD>
	</TR>
	<TR BGCOLOR="#c0c0c0">
		<TD>
			<P>(Wie sagt man so sch&ouml;n: &quot;Wenn das einzige Werkzeug
			ein Hammer ist, dann sehen alle Probleme wie N&auml;gel aus.&quot;)
						</P>
		</TD>
	</TR>
	<TR>
		<TD>
			<P>In C++ k&ouml;nnen Sie objektorientiert programmieren, Sie
			m&uuml;ssen aber nicht. 
			</P>
		</TD>
	</TR>
</TABLE>
<P>Und jetzt kommen Sie bitte n&auml;her... Ja, so ist es gut... Denn
jetzt kommt etwas sehr Wichtiges:</P>
<UL>
	<P>Die main-Funktion hat den R&uuml;ckgabewert <B>int</B> und <I>nicht</I>
	<B>void</B>. Das ist im <A HREF="#StandardCpp">C++-Standard</A> so
	definiert. Es gibt zwar einige Compiler, die auch eine Deklaration
	mit <B>void</B> durchgehen lassen, aber das ist nicht C++. Sie
	wissen das jetzt, und deshalb werden Sie immer int main() schreiben
	und niemals void main(). Und wenn Sie irgendwo void main() sehen,
	dann wissen Sie es besser: Derjenige konnte nicht richtig C++.</P>
	<P>Und wenn Sie gar keinen R&uuml;ckgabewert brauchen? Dann
	schreiben Sie am Ende der main()-Funktion einfach 
	</P>
	<PRE STYLE="margin-bottom: 0.5cm">return 0;</PRE><P>
	&Uuml;brigens: Wenn Sie das weglassen, tut der Compiler so, als ob
	sie es hingeschrieben h&auml;tten. Es ist also (Ausnahme f&uuml;r
	die main()-Funktion!) kein Fehler, das return wegzulassen, obwohl
	der R&uuml;ckgabetyp von main() <B>int</B> ist.</P>
</UL>
<P>Es ist &uuml;blich, das ordnungsgem&auml;&szlig;e Beenden eines
Programms mit dem R&uuml;ckgabewert 0 anzuzeigen und Fehler mit
R&uuml;ckgabewerten ungleich 0 anzuzeigen. Damit k&ouml;nnen andere
Programme, die Ihr Programm aufrufen, auf Fehler entsprechend
reagieren.</P>
<H3><A NAME="StandardCpp"></A>Standard ISO/IEC 14882</H3>
<P>Hinter dieser kryptischen Bezeichnung verbirgt sich das Dokument,
in dem die Sprache C++ zu einem international anerkannten Standard
geworden ist. Darin steht detailliert beschrieben, wie die Sprache
aufgebaut ist.</P>
<P>Dieser Standard ist herstellerunabh&auml;ngig - es kann also keine
Firma einfach sagen, C++ ist auf einmal etwas anderes.</P>
<P><BR><BR>
</P>
<P STYLE="margin-bottom: 0cm"><A HREF="../../Startseite.html"><B><FONT SIZE=2><FONT FACE="Arial, sans-serif">Zur&uuml;ck
zur Startseite</FONT></FONT></B></A></P>
</BODY>
</HTML>